solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/fsl_sfdp_parser.c
/*
 * Copyright 2024 NXP
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "fsl_sfdp_parser.h"

/*******************************************************************************
 * Definitions
 ******************************************************************************/
const uint8_t g_sfdpXspiProfile1OpiCmdShift[SFDP_XSPI_PROFILE_OPI_CMD_COUNT] = {31U, 28U, 26U, 20U, 25U, 0xFFU, 0xFFU};
const uint8_t g_sfdpXspiProfile2OpiCmdShift[SFDP_XSPI_PROFILE_OPI_CMD_COUNT] = {0xFFU, 13U, 12U,  0xFFU,
                                                                                17U,   19U, 0xFFU};
/*******************************************************************************
 * Prototypes
 ******************************************************************************/

/*******************************************************************************
 * Variables
 ******************************************************************************/
typedef struct _sfdp_func_table_info
{
    uint32_t indexOfArray : 7U;
    uint32_t supported : 1U;
    uint32_t paramTableRevision : 16U;
    uint32_t reserved : 8U;
} sfdp_func_table_info_t;

struct
{
    sfdp_func_table_info_t sectorMapTable;
    sfdp_func_table_info_t rpmcTable;
    sfdp_func_table_info_t fourByteAddrInstTable;
    sfdp_func_table_info_t xSPIProfile1Table;
    sfdp_func_table_info_t xSPIProfile2Table;
    sfdp_func_table_info_t SCCRegMapTable;
    sfdp_func_table_info_t SCCRegMapxSPIProfile2Table;
    sfdp_func_table_info_t SCCRegMapMultiChipTable;
    sfdp_func_table_info_t cmdSeq2OctalDDR;
    sfdp_func_table_info_t x4QualIOWithDS;
    sfdp_func_table_info_t cmdSeq2QuadDDR;
    sfdp_func_table_info_t securePacketRWTable;
} g_sfdpFuncTables;

/*******************************************************************************
 * Code
 ******************************************************************************/

/************************** Static Functions Start ****************************/

static inline uint16_t SFDP_GetParamId(sfdp_param_header_t *ptrParamHeader)
{
    return (ptrParamHeader->idMsb << 8U) | (ptrParamHeader->idLsb);
}

static inline uint16_t SFDP_GetParamRevision(sfdp_param_header_t *ptrParamHeader)
{
    return (ptrParamHeader->majorRev << 8U) | (ptrParamHeader->minorRev);
}

static void SFDP_InterpretSFDPParamHeaders(sfdp_param_header_t *ptrSfdpParamHeaders, sfdp_handle_t *handle)
{
    uint8_t paramTableCount                = handle->nph + 1U;
    sfdp_param_header_t *ptrCurParamHeader = NULL;
    SFDP_SpiReadFunc spiReadTable          = handle->spiRead;

    (void)memset(&g_sfdpFuncTables, 0UL, sizeof(g_sfdpFuncTables));

    for (uint8_t i = 0U; i < paramTableCount; i++)
    {
        ptrCurParamHeader = &(ptrSfdpParamHeaders[i]);
        switch (SFDP_GetParamId(ptrCurParamHeader))
        {
            case 0xFF00U:
            {
                (void)spiReadTable(ptrCurParamHeader->ptp, (uint32_t *)((uint32_t)(&(handle->bfp))),
                                   (4UL * ptrCurParamHeader->len));
                break;
            }
            case 0xFF81U:
            {
                g_sfdpFuncTables.sectorMapTable.supported          = 1U;
                g_sfdpFuncTables.sectorMapTable.indexOfArray       = i;
                g_sfdpFuncTables.sectorMapTable.paramTableRevision = SFDP_GetParamRevision(&(ptrSfdpParamHeaders[i]));
                (void)spiReadTable(ptrCurParamHeader->ptp, (uint32_t *)((uint32_t)(&(handle->sectorMapTable))),
                                   (4UL * ptrCurParamHeader->len));
                break;
            }
            case 0xFF03U:
            {
                g_sfdpFuncTables.rpmcTable.supported    = 1U;
                g_sfdpFuncTables.rpmcTable.indexOfArray = i;
                g_sfdpFuncTables.fourByteAddrInstTable.paramTableRevision =
                    SFDP_GetParamRevision(&(ptrSfdpParamHeaders[i]));
                (void)spiReadTable(ptrCurParamHeader->ptp, (uint32_t *)((uint32_t)(&(handle->rpmcTable))),
                                   (4UL * ptrCurParamHeader->len));
                break;
            }
            case 0xFF84U:
            {
                g_sfdpFuncTables.fourByteAddrInstTable.supported    = 1U;
                g_sfdpFuncTables.fourByteAddrInstTable.indexOfArray = i;
                g_sfdpFuncTables.fourByteAddrInstTable.paramTableRevision =
                    SFDP_GetParamRevision(&(ptrSfdpParamHeaders[i]));
                (void)spiReadTable(ptrCurParamHeader->ptp, (uint32_t *)((uint32_t)(&(handle->fourByteAddrInstTable))),
                                   (4UL * ptrCurParamHeader->len));
                break;
            }
            case 0xFF05U:
            {
                g_sfdpFuncTables.xSPIProfile1Table.supported    = 1U;
                g_sfdpFuncTables.xSPIProfile1Table.indexOfArray = i;
                g_sfdpFuncTables.xSPIProfile1Table.paramTableRevision =
                    SFDP_GetParamRevision(&(ptrSfdpParamHeaders[i]));
                (void)spiReadTable(ptrCurParamHeader->ptp, (uint32_t *)((uint32_t)(&(handle->xSPIProfile1Table))),
                                   (4UL * ptrCurParamHeader->len));
                break;
            }
            case 0xFF06U:
            {
                g_sfdpFuncTables.xSPIProfile2Table.supported    = 1U;
                g_sfdpFuncTables.xSPIProfile2Table.indexOfArray = i;
                g_sfdpFuncTables.xSPIProfile2Table.paramTableRevision =
                    SFDP_GetParamRevision(&(ptrSfdpParamHeaders[i]));
                (void)spiReadTable(ptrCurParamHeader->ptp, (uint32_t *)((uint32_t)(&(handle->xSPIProfile2Table))),
                                   (4UL * ptrCurParamHeader->len));
                break;
            }
            case 0xFF87U:
            {
                g_sfdpFuncTables.SCCRegMapTable.supported          = 1U;
                g_sfdpFuncTables.SCCRegMapTable.indexOfArray       = i;
                g_sfdpFuncTables.SCCRegMapTable.paramTableRevision = SFDP_GetParamRevision(&(ptrSfdpParamHeaders[i]));
                (void)spiReadTable(ptrCurParamHeader->ptp, (uint32_t *)((uint32_t)(&(handle->SCCRegMapTable))),
                                   (4UL * ptrCurParamHeader->len));
                break;
            }
            case 0xFF88U:
            {
                g_sfdpFuncTables.SCCRegMapMultiChipTable.supported    = 1U;
                g_sfdpFuncTables.SCCRegMapMultiChipTable.indexOfArray = i;
                g_sfdpFuncTables.SCCRegMapMultiChipTable.paramTableRevision =
                    SFDP_GetParamRevision(&(ptrSfdpParamHeaders[i]));
                (void)spiReadTable(ptrCurParamHeader->ptp, (uint32_t *)((uint32_t)(&(handle->SCCRegMapMultiChipTable))),
                                   (4UL * ptrCurParamHeader->len));
                break;
            }
            case 0xFF09U:
            {
                g_sfdpFuncTables.SCCRegMapxSPIProfile2Table.supported    = 1U;
                g_sfdpFuncTables.SCCRegMapxSPIProfile2Table.indexOfArray = i;
                g_sfdpFuncTables.SCCRegMapxSPIProfile2Table.paramTableRevision =
                    SFDP_GetParamRevision(&(ptrSfdpParamHeaders[i]));
                (void)spiReadTable(ptrCurParamHeader->ptp,
                                   (uint32_t *)((uint32_t)(&(handle->SCCRegMapxSPIProfile2Table))),
                                   (4UL * ptrCurParamHeader->len));
                break;
            }
            case 0xFF0AU:
            {
                g_sfdpFuncTables.cmdSeq2OctalDDR.supported          = 1U;
                g_sfdpFuncTables.cmdSeq2OctalDDR.indexOfArray       = i;
                g_sfdpFuncTables.cmdSeq2OctalDDR.paramTableRevision = SFDP_GetParamRevision(&(ptrSfdpParamHeaders[i]));
                (void)spiReadTable(ptrCurParamHeader->ptp, (uint32_t *)((uint32_t)(&(handle->cmdSeq2OctalDDR))),
                                   (4UL * ptrCurParamHeader->len));
                break;
            }
            case 0xFF0C:
            {
                g_sfdpFuncTables.x4QualIOWithDS.supported          = 1U;
                g_sfdpFuncTables.x4QualIOWithDS.indexOfArray       = i;
                g_sfdpFuncTables.x4QualIOWithDS.paramTableRevision = SFDP_GetParamRevision(&(ptrSfdpParamHeaders[i]));
                (void)spiReadTable(ptrCurParamHeader->ptp, (uint32_t *)((uint32_t)(&(handle->x4QualIOWithDS))),
                                   (4UL * ptrCurParamHeader->len));
                break;
            }
            case 0xFF8D:
            {
                g_sfdpFuncTables.cmdSeq2QuadDDR.supported          = 1U;
                g_sfdpFuncTables.cmdSeq2QuadDDR.indexOfArray       = i;
                g_sfdpFuncTables.cmdSeq2QuadDDR.paramTableRevision = SFDP_GetParamRevision(&(ptrSfdpParamHeaders[i]));
                (void)spiReadTable(ptrCurParamHeader->ptp, (uint32_t *)((uint32_t)(&(handle->cmdSeq2QuadDDR))),
                                   (4UL * ptrCurParamHeader->len));
                break;
            }
            case 0xFF8E:
            {
                g_sfdpFuncTables.securePacketRWTable.supported    = 1U;
                g_sfdpFuncTables.securePacketRWTable.indexOfArray = i;
                g_sfdpFuncTables.securePacketRWTable.paramTableRevision =
                    SFDP_GetParamRevision(&(ptrSfdpParamHeaders[i]));
                (void)spiReadTable(ptrCurParamHeader->ptp, (uint32_t *)((uint32_t)(&(handle->securePacketRWTable))),
                                   (4UL * ptrCurParamHeader->len));
                break;
            }
            default:
            {
                break;
            }
        }
    }
}

static inline bool SFDP_CheckSignature(sfdp_header_t *ptrSfdpHeader)
{
    return (bool)(ptrSfdpHeader->signature == 0x50444653UL);
}

