solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/fsl_sfdp_parser.c
static void SFDP_Get1PadReadCmd(sfdp_handle_t *handle,
                                sfdp_protocol_type_t protocolType,
                                sfdp_read_cmd_info_t *ptr1PadReadCmdInfo)
{
    if (protocolType == kSFDP_Protocol_1s1s1s)
    {
        ptr1PadReadCmdInfo->dummyCycle  = 8U;
        ptr1PadReadCmdInfo->instruction = 0x0BU;
        if ((handle->addrMode != kSFDP_AddrMode_3ByteOnly) && (g_sfdpFuncTables.fourByteAddrInstTable.supported != 0U))
        {
            /* In case of 4-byte instruction supported. */
            if ((handle->fourByteAddrInstTable.dw1 & 0x2UL) != 0UL)
            {
                ptr1PadReadCmdInfo->instruction = 0x0CU;
            }
        }
    }
    else
    {
        ptr1PadReadCmdInfo->dummyCycle  = handle->bfp.dw22 & 0x1FUL;
        ptr1PadReadCmdInfo->instruction = (handle->bfp.dw22 & 0xFF00UL) >> 8UL;
        if ((handle->addrMode != kSFDP_AddrMode_3ByteOnly) && (g_sfdpFuncTables.fourByteAddrInstTable.supported != 0U))
        {
            /* In case of 4-byte instruction supported. */
            if ((handle->fourByteAddrInstTable.dw1 & 0x2000UL) != 0UL)
            {
                ptr1PadReadCmdInfo->instruction = 0x0EU;
            }
        }
        ptr1PadReadCmdInfo->modeClocks = (handle->bfp.dw22 & 0xE0UL) >> 5UL;
    }
}

static void SFDP_Get2PadReadCmd(sfdp_handle_t *handle,
                                sfdp_protocol_type_t protocolType,
                                sfdp_read_cmd_info_t *ptr2PadReadCmdInfo)
{
    if (protocolType == kSFDP_Protocol_1s1s2s)
    {
        ptr2PadReadCmdInfo->dummyCycle  = (uint8_t)(handle->bfp.dw4 & 0x1FUL);
        ptr2PadReadCmdInfo->modeClocks  = (uint8_t)((handle->bfp.dw4 & 0xE0UL) >> 5UL);
        ptr2PadReadCmdInfo->instruction = (uint8_t)((handle->bfp.dw4 & 0xFF00UL) >> 8UL);
    }
    else if (protocolType == kSFDP_Protocol_1s2s2s)
    {
        ptr2PadReadCmdInfo->dummyCycle  = (uint8_t)((handle->bfp.dw4 & 0x1F0000UL) >> 16UL);
        ptr2PadReadCmdInfo->modeClocks  = (uint8_t)((handle->bfp.dw4 & 0xE00000UL) >> 21UL);
        ptr2PadReadCmdInfo->instruction = (uint8_t)((handle->bfp.dw4 & 0xFF000000UL) >> 24UL);
    }
    else if (protocolType == kSFDP_Protocol_1s2d2d)
    {
        ptr2PadReadCmdInfo->dummyCycle  = (uint8_t)((handle->bfp.dw22 & 0x1F0000UL) >> 16UL);
        ptr2PadReadCmdInfo->modeClocks  = (uint8_t)((handle->bfp.dw22 & 0xE00000UL) >> 21UL);
        ptr2PadReadCmdInfo->instruction = (uint8_t)((handle->bfp.dw22 & 0xFF000000UL) >> 24UL);
        if ((handle->addrMode != kSFDP_AddrMode_3ByteOnly) && (g_sfdpFuncTables.fourByteAddrInstTable.supported != 0U))
        {
            /* In case of 4 byte address mode. */
            if ((handle->fourByteAddrInstTable.dw1 & 0x4000UL) != 0UL)
            {
                ptr2PadReadCmdInfo->instruction = 0xBEU;
            }
        }
    }
    else if (protocolType == kSFDP_Protocol_2s2s2s)
    {
        ptr2PadReadCmdInfo->dummyCycle  = (uint8_t)((handle->bfp.dw6 & 0x1F0000UL) >> 16UL);
        ptr2PadReadCmdInfo->modeClocks  = (uint8_t)((handle->bfp.dw6 & 0xE00000UL) >> 21UL);
        ptr2PadReadCmdInfo->instruction = (uint8_t)((handle->bfp.dw6 & 0xFF000000UL) >> 24UL);
    }
    else
    {
    }
}

static void SFDP_Get4PadReadCmd(sfdp_handle_t *handle,
                                sfdp_protocol_type_t protocolType,
                                uint32_t clkFreq,
                                sfdp_read_cmd_info_t *ptr4PadReadCmdInfo)
{
    if (protocolType == kSFDP_Protocol_1s1s4s)
    {
        ptr4PadReadCmdInfo->dummyCycle  = (uint8_t)((handle->bfp.dw3 & 0x1F0000UL) >> 16UL);
        ptr4PadReadCmdInfo->modeClocks  = (uint8_t)((handle->bfp.dw3 & 0xE00000UL) >> 21UL);
        ptr4PadReadCmdInfo->instruction = (uint8_t)((handle->bfp.dw3 & 0xFF000000UL) >> 24UL);

        if ((handle->addrMode != kSFDP_AddrMode_3ByteOnly) && (g_sfdpFuncTables.fourByteAddrInstTable.supported != 0U))
        {
            if ((handle->fourByteAddrInstTable.dw1 & 0x80UL) != 0UL)
            {
                /* In case of 4byte address mode support for 1s-1s-4s fast read command. */
                ptr4PadReadCmdInfo->instruction = 0x6CU;
            }
        }
    }
    else if (protocolType == kSFDP_Protocol_1s4s4s)
    {
        ptr4PadReadCmdInfo->dummyCycle  = (uint8_t)(handle->bfp.dw3 & 0x1FUL);
        ptr4PadReadCmdInfo->modeClocks  = (uint8_t)((handle->bfp.dw3 & 0xE0UL) >> 5UL);
        ptr4PadReadCmdInfo->instruction = (uint8_t)((handle->bfp.dw3 & 0xFF00UL) >> 8UL);

        if ((handle->addrMode != kSFDP_AddrMode_3ByteOnly) && (g_sfdpFuncTables.fourByteAddrInstTable.supported != 0U))
        {
            if ((handle->fourByteAddrInstTable.dw1 & 0x100UL) != 0UL)
            {
                /* In case of 4byte address mode support for 1s-4s-4s fast read command. */
                ptr4PadReadCmdInfo->instruction = 0xECU;
            }
        }
    }
    else if (protocolType == kSFDP_Protocol_1s4d4d)
    {
        ptr4PadReadCmdInfo->dummyCycle  = handle->bfp.dw23 & 0x1FUL;
        ptr4PadReadCmdInfo->modeClocks  = (handle->bfp.dw23 & 0xE0UL) >> 5UL;
        ptr4PadReadCmdInfo->instruction = (handle->bfp.dw23 & 0xFF00UL) >> 8UL;
        if ((handle->addrMode != kSFDP_AddrMode_3ByteOnly) && (g_sfdpFuncTables.fourByteAddrInstTable.supported != 0U))
        {
            if ((handle->fourByteAddrInstTable.dw1 & 0x8000UL) != 0UL)
            {
                ptr4PadReadCmdInfo->instruction = 0xEEU;
            }
        }
    }
    else if (protocolType == kSFDP_Protocol_4s4s4s)
    {
        ptr4PadReadCmdInfo->dummyCycle  = (uint8_t)((handle->bfp.dw7 & 0x1F0000UL) >> 16UL);
        ptr4PadReadCmdInfo->modeClocks  = (uint8_t)((handle->bfp.dw7 & 0xE00000UL) >> 21UL);
        ptr4PadReadCmdInfo->instruction = (uint8_t)((handle->bfp.dw7 & 0xFF000000UL) >> 24UL);
    }
    else if (protocolType == kSFDP_Protocol_4s4d4d)
    {
        ptr4PadReadCmdInfo->dummyCycle  = (uint8_t)((handle->bfp.dw23 & 0x1F0000UL) >> 16UL);
        ptr4PadReadCmdInfo->modeClocks  = (uint8_t)((handle->bfp.dw23 & 0xE00000UL) >> 21UL);
        ptr4PadReadCmdInfo->instruction = (uint8_t)((handle->bfp.dw23 & 0xFF000000UL) >> 24UL);
        if ((g_sfdpFuncTables.x4QualIOWithDS.supported != 0U) && SFDP_CheckDSSupportedForQpiDtrMode(handle))
        {
            if (clkFreq == 100000000UL)
            {
                ptr4PadReadCmdInfo->dummyCycle = (uint8_t)((handle->x4QualIOWithDS.dw5 & 0xF80UL) >> 7UL);
            }
            else if (clkFreq == 133000000UL)
            {
                ptr4PadReadCmdInfo->dummyCycle = (uint8_t)((handle->x4QualIOWithDS.dw5 & 0x3E0000UL) >> 17UL);
            }
            else if (clkFreq == 166000000UL)
            {
                ptr4PadReadCmdInfo->dummyCycle = (uint8_t)((handle->x4QualIOWithDS.dw5 & 0xF8000000UL) >> 27UL);
            }
            else if (clkFreq == 200000000UL)
            {
                ptr4PadReadCmdInfo->dummyCycle = (uint8_t)((handle->x4QualIOWithDS.dw4 & 0xF80UL) >> 7UL);
            }
            else
            {
            }
        }
    }
    else
    {
    }
}

static void SFDP_Get8PadReadCmd(sfdp_handle_t *handle,
                                sfdp_protocol_type_t protocolType,
                                uint32_t clkFreq,
                                sfdp_read_cmd_info_t *ptr8PadReadCmdInfo)
{
    if (protocolType == kSFDP_Protocol_1s1s8s)
    {
        ptr8PadReadCmdInfo->dummyCycle  = (uint8_t)((handle->bfp.dw17 & 0x1F0000UL) >> 16UL);
        ptr8PadReadCmdInfo->modeClocks  = (uint8_t)((handle->bfp.dw17 & 0xE00000UL) >> 21UL);
        ptr8PadReadCmdInfo->instruction = (uint8_t)((handle->bfp.dw17 & 0xFF000000UL) >> 24UL);
        if ((handle->addrMode != kSFDP_AddrMode_3ByteOnly) && (g_sfdpFuncTables.fourByteAddrInstTable.supported != 0U))
        {
            /* In case of 4 byte address mode. */
            if ((handle->fourByteAddrInstTable.dw1 & 0x800000UL) != 0UL)
            {
                ptr8PadReadCmdInfo->instruction = 0x7CU;
            }
        }
    }
    else if (protocolType == kSFDP_Protocol_1s8s8s)
    {
        ptr8PadReadCmdInfo->dummyCycle  = (uint8_t)(handle->bfp.dw17 & 0x1FUL);
        ptr8PadReadCmdInfo->modeClocks  = (uint8_t)((handle->bfp.dw17 & 0xE0UL) >> 5UL);
        ptr8PadReadCmdInfo->instruction = (uint8_t)((handle->bfp.dw17 & 0xFF00UL) >> 8UL);
        if ((handle->addrMode != kSFDP_AddrMode_3ByteOnly) && (g_sfdpFuncTables.fourByteAddrInstTable.supported != 0U))
        {
            /* In case of 4 byte address mode. */
            if ((handle->fourByteAddrInstTable.dw1 & 0x1000000UL) != 0UL)
            {
                ptr8PadReadCmdInfo->instruction = 0xCCU;
            }
        }
    }
    else if (protocolType == kSFDP_Protocol_1s8d8d)
    {
        if (g_sfdpFuncTables.fourByteAddrInstTable.supported != 0U)
        {
            if ((handle->fourByteAddrInstTable.dw1 & 0x400000UL) != 0UL)
            {
                ptr8PadReadCmdInfo->instruction = 0xFDU;
                ptr8PadReadCmdInfo->dummyCycle  = 16U;
                ptr8PadReadCmdInfo->modeClocks  = 0U;
            }
        }
    }
    else if (protocolType == kSFDP_Protocol_8s8s8s)
    {
        ptr8PadReadCmdInfo->instruction = 0xECU;
        ptr8PadReadCmdInfo->dummyCycle  = 16U;
        ptr8PadReadCmdInfo->modeClocks  = 0U;

