solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/fsl_sfdp_parser.c
        if (g_sfdpFuncTables.xSPIProfile1Table.supported != 0U)
        {
            if (clkFreq == 100000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile1Table.dw5 & 0xF80UL) >> 7UL);
            }
            else if (clkFreq == 133000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile1Table.dw5 & 0x3E0000UL) >> 12UL);
            }
            else if (clkFreq == 166000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile1Table.dw5 & 0xF8000000UL) >> 27UL);
            }
            else if (clkFreq == 200000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile1Table.dw4 & 0xF80UL) >> 7UL);
            }
            else
            {
            }
        }
        else if (g_sfdpFuncTables.xSPIProfile2Table.supported != 0U)
        {
            if (clkFreq == 100000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile2Table.dw3 & 0xF80UL) >> 7UL);
            }
            else if (clkFreq == 133000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile2Table.dw3 & 0x3E0000UL) >> 12UL);
            }
            else if (clkFreq == 166000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile2Table.dw3 & 0xF8000000UL) >> 27UL);
            }
            else if (clkFreq == 200000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile2Table.dw2 & 0xF80UL) >> 7UL);
            }
            else
            {
            }
        }
    }
    else if (protocolType == kSFDP_Protocol_8d8d8d)
    {
        ptr8PadReadCmdInfo->instruction = 0xCCU;
        ptr8PadReadCmdInfo->dummyCycle  = 16U;
        ptr8PadReadCmdInfo->modeClocks  = 0U;
        if (g_sfdpFuncTables.xSPIProfile1Table.supported != 0U)
        {
            ptr8PadReadCmdInfo->instruction = (uint8_t)((handle->xSPIProfile1Table.dw1 & 0xFF00UL) >> 8UL);
            if (clkFreq == 100000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile1Table.dw5 & 0xF80UL) >> 7UL);
            }
            else if (clkFreq == 133000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile1Table.dw5 & 0x3E0000UL) >> 12UL);
            }
            else if (clkFreq == 166000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile1Table.dw5 & 0xF8000000UL) >> 27UL);
            }
            else if (clkFreq == 200000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile1Table.dw4 & 0xF80UL) >> 7UL);
            }
            else
            {
            }
        }
        else if (g_sfdpFuncTables.xSPIProfile2Table.supported != 0U)
        {
            if (clkFreq == 100000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile2Table.dw3 & 0xF80UL) >> 7UL);
            }
            else if (clkFreq == 133000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile2Table.dw3 & 0x3E0000UL) >> 12UL);
            }
            else if (clkFreq == 166000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile2Table.dw3 & 0xF8000000UL) >> 27UL);
            }
            else if (clkFreq == 200000000UL)
            {
                ptr8PadReadCmdInfo->dummyCycle = (uint8_t)((handle->xSPIProfile2Table.dw2 & 0xF80UL) >> 7UL);
            }
            else
            {
            }
        }
    }
    else
    {
    }
}

/************************** Static Functions End ****************************/

/************************ Read SFDP Data Sets Start *************************/

/*!
 * @brief Read SFDP header, and check if SFDP signature is correct.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] spiRead The function to read sfdp header.
 *
 * @retval kSFDP_RET_HardwareIssue Fail to read SFDP header due to some hardware issue.
 * @retval kSFDP_RET_Invalid Fail to read SFDP header due to invalid SFDP signature.
 * @retval kSFDP_RET_Success Successfully to read sfdp header.
 */
sfdp_ret_type_t SFDP_ReadSFDPHeader(sfdp_handle_t *handle, SFDP_SpiReadFunc spiRead)
{
    assert(handle != NULL);
    assert(spiRead != NULL);

    status_t status = kStatus_Success;

    /* Read SFDP header: address is 0, size is 8 bytes. */
    sfdp_header_t tmpSfdpHeader;

    status = spiRead(0UL, (uint32_t *)((uint32_t)&tmpSfdpHeader), 8UL);

    if (status != kStatus_Success)
    {
        return kSFDP_RET_HardwareIssue;
    }

    if (SFDP_CheckSignature(&tmpSfdpHeader) == false)
    {
        return kSFDP_RET_Invalid;
    }

    handle->spiRead         = spiRead;
    handle->curJEDECVersion = (sfdp_revsion_t)SFDP_REVISION(tmpSfdpHeader.majorRev, tmpSfdpHeader.minorRev);
    handle->nph             = tmpSfdpHeader.nph;
    handle->access          = tmpSfdpHeader.access;
    return kSFDP_RET_Success;
}

/*!
 * @brief Read SFDP parameter header.
 *
 * @param[out] ptrSfdpParamHeader Pointer to the variable in type of @ref sfdp_param_header_t
                                to store sfdp parameter header.
 * @param[in] nph Number of parameter header.
 * @param[in] spiRead Function to read sfdp parameter header.
 *
 * @retval kStatus_Success Successfully to read SFDP parameter header.
 * @retval kSFDP_RET_HardwareIssue Fail to read SFDP parameter header due to some hardware issues.
 */
sfdp_ret_type_t SFDP_ReadSFDPParameterHeader(sfdp_param_header_t *ptrSfdpParamHeader,
                                             uint8_t nph,
                                             SFDP_SpiReadFunc spiRead)
{
    status_t status;

    status = spiRead(0x8UL, (uint32_t *)((uint32_t)ptrSfdpParamHeader), 8UL * (nph + 1UL));

    if (status != kStatus_Success)
    {
        return kSFDP_RET_HardwareIssue;
    }

    return kSFDP_RET_Success;
}

/*!
 * @brief Read all current serial flash device supported parameter tables.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @retval kSFDP_RET_HardwareIssue Fail to read SFDP parameter header due to some hardware issues.
 * @retval kSFDP_RET_Success Successfully to read all supported parameter tables.
 */
sfdp_ret_type_t SFDP_ReadAllSupportedTable(sfdp_handle_t *handle)
{
    sfdp_ret_type_t ret;

    sfdp_param_header_t *ptrSfdpParamHeader = NULL;

    ptrSfdpParamHeader = (sfdp_param_header_t *)(uint32_t)malloc((handle->nph + 1U) * 8U);
    ret                = SFDP_ReadSFDPParameterHeader(ptrSfdpParamHeader, handle->nph, handle->spiRead);

    if (ret != kSFDP_RET_Success)
    {
        free((void *)(uint32_t)ptrSfdpParamHeader);
        return kSFDP_RET_HardwareIssue;
    }

    SFDP_InterpretSFDPParamHeaders(ptrSfdpParamHeader, handle);
    free((void *)(uint32_t)ptrSfdpParamHeader);

    handle->addrMode = SFDP_GetAddressBytes(handle);

    return kSFDP_RET_Success;
}
/************************ Read SFDP Data Sets End *************************/

/******************* Get Flash Basic Attributes Start *********************/
/*!
 * @brief Get Flash Density, the result is in unit of KB.

 * @param[in] ptrBfp Pointer to the variable in type of @ref sfdp_basic_flash_param_table_t.
 *
 * @return In unit of KB, 64 means 64KB(512 Kb)
 */
uint32_t SFDP_GetFlashDensity(sfdp_handle_t *handle)
{
    assert(handle != NULL);

    uint32_t dw        = handle->bfp.dw2;
    uint64_t bitsCount = 0ULL;

    if ((dw & (1UL << 31UL)) == 0UL)
    {
        /* For densities 2 gigabits or less, bit 31 is set to 0b. The field 30:0 defines the size in bits.  */
        bitsCount = (uint64_t)dw + 1ULL;
    }
    else
    {
        dw &= ((1UL << 31UL) - 1UL);
        /* For densities 4 gigabits and above, bit 31 is set to 1. The field 30:0 defines "N" when density is computed
            2^N bits. */
        bitsCount = (1ULL << dw);
    }

    return (uint32_t)(bitsCount >> 13UL);
}

/*!
 * @brief Get page size, the result in unit of Byte.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 *
 * @return The size of page.
 */
uint32_t SFDP_GetPageSize(sfdp_handle_t *handle)
{
    assert(handle != NULL);

    uint8_t n = 0U;

