solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/fsl_sfdp_parser.c
    n = (handle->bfp.dw11 & 0xF0) >> 4U;

    if (n == 0U)
    {
        return 256;
    }
    else
    {
        return 1UL << (uint32_t)n;
    }
}

/*!
 * @brief Get flash interface mode based on input policy, and number of data pad.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] cmdPolicy The policy used to select interface mode, in type of @ref sfdp_cmd_policy_t.
 * @param[in] flashPadNum The number of data pad, in type of @ref sfdp_flash_pad_num_t
 *
 * @return Calculated protocol type, in type of @ref sfdp_protocol_type_t.
 */
sfdp_protocol_type_t SFDP_GetFlashProtocolType(sfdp_handle_t *handle,
                                               sfdp_cmd_policy_t cmdPolicy,
                                               sfdp_flash_pad_num_t flashPadNum)
{
    sfdp_protocol_type_t protocolTypeSelected = kSFDP_Protocol_1s1s1s;

    switch (flashPadNum)
    {
        case kSFDP_Flash1Pad:
        {
            if (cmdPolicy >= kSFDP_CmdPolicy_LowestThroughput)
            {
                protocolTypeSelected = kSFDP_Protocol_1s1s1s;
            }
            else
            {
                if ((handle->bfp.dw21 & 0x1UL) != 0UL)
                {
                    protocolTypeSelected = kSFDP_Protocol_1s1d1d;
                }
            }
            break;
        }
        case kSFDP_Flash2Pad:
        {
            if ((cmdPolicy == kSFDP_CmdPolicy_DdrIO) || (cmdPolicy == kSFDP_CmdPolicy_HighestThroughput))
            {
                if ((handle->bfp.dw21 & 0x2UL) != 0UL)
                {
                    protocolTypeSelected = kSFDP_Protocol_1s2d2d;
                }
            }
            else if (cmdPolicy == kSFDP_CmdPolicy_SdrIO)
            {
                if ((handle->bfp.dw1 & 0x100000UL) != 0UL)
                {
                    protocolTypeSelected = kSFDP_Protocol_1s2s2s;
                }
                if ((handle->bfp.dw5 & 0x1UL) != 0UL)
                {
                    protocolTypeSelected = kSFDP_Protocol_2s2s2s;
                }
            }
            else if ((cmdPolicy == kSFDP_CmdPolicy_SdrOutput) || (cmdPolicy == kSFDP_CmdPolicy_LowestThroughput))
            {
                if ((handle->bfp.dw1 & 0x10000UL) != 0UL)
                {
                    protocolTypeSelected = kSFDP_Protocol_1s1s2s;
                }
            }
            else
            {
            }
            break;
        }
        case kSFDP_Flash4Pad:
        {
            if (cmdPolicy == kSFDP_CmdPolicy_DdrIO)
            {
                if ((handle->curJEDECVersion > kSFDP_JESD216E) && ((handle->bfp.dw21 & 0x4UL) != 0UL))
                {
                    protocolTypeSelected = kSFDP_Protocol_1s4d4d;
                }
            }
            else if (cmdPolicy == kSFDP_CmdPolicy_HighestThroughput)
            {
                if ((handle->curJEDECVersion > kSFDP_JESD216E) && ((handle->bfp.dw21 & 0x8UL) != 0UL))
                {
                    protocolTypeSelected = kSFDP_Protocol_4s4d4d;
                }
            }
            else if (cmdPolicy == kSFDP_CmdPolicy_SdrIO)
            {
                if ((handle->bfp.dw1 & 0x200000UL) != 0UL)
                {
                    protocolTypeSelected = kSFDP_Protocol_1s4s4s;
                }

                if ((handle->bfp.dw5 & 0x10UL) != 0UL)
                {
                    protocolTypeSelected = kSFDP_Protocol_4s4s4s;
                }
            }
            else if ((cmdPolicy == kSFDP_CmdPolicy_SdrOutput) || (cmdPolicy == kSFDP_CmdPolicy_LowestThroughput))
            {
                if ((handle->bfp.dw1 & 0x400000UL) != 0UL)
                {
                    protocolTypeSelected = kSFDP_Protocol_1s1s4s;
                }
            }
            else
            {
            }

            break;
        }
        case kSFDP_Flash8Pad:
        {
            if (cmdPolicy == kSFDP_CmdPolicy_SdrIO)
            {
                if ((handle->curJEDECVersion >= kSFDP_JESD216A) && ((handle->bfp.dw17 & 0xFF00UL) != 0UL))
                {
                    protocolTypeSelected = kSFDP_Protocol_1s8s8s;
                }

                protocolTypeSelected = kSFDP_Protocol_8s8s8s;
            }
            else if ((cmdPolicy == kSFDP_CmdPolicy_SdrOutput) || (cmdPolicy == kSFDP_CmdPolicy_LowestThroughput))
            {
                if ((handle->curJEDECVersion >= kSFDP_JESD216A) && ((handle->bfp.dw17 & 0xFF000000UL) != 0UL))
                {
                    protocolTypeSelected = kSFDP_Protocol_1s1s8s;
                }
            }
            else if (cmdPolicy == kSFDP_CmdPolicy_DdrOutput)
            {
                protocolTypeSelected = kSFDP_Protocol_1s8d8d;
            }
            else if (cmdPolicy == kSFDP_CmdPolicy_HighestThroughput)
            {
                protocolTypeSelected = kSFDP_Protocol_8d8d8d;
            }

            break;
        }
        default:
        {
            assert(false);
        }
    }

    return protocolTypeSelected;
}

/******************* Get Flash Basic Attributes End *********************/

/*********************** Get QPI Attributes Start ***********************/
/*!
 * @brief Get sequence to entry 4s-4d-4d mode.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrEntrySe The parameter to store sequences to enter 4s-4d-4d mode,
                        in type of @ref sfdp_4s4d4d_entry_seq_t.
 *
 * @retval kSFDP_RET_Success Successfully to get 4s-4d-4d entry sequence.
 * @retval kSFDP_RET_NotImplemented Current serial flash device does not support 4s-4d-4d entry sequence.
 */
sfdp_ret_type_t SFDP_Get4s4d4dEntrySeq(sfdp_handle_t *handle, sfdp_4s4d4d_entry_seq_t *ptrEntrySeq)
{
    if (g_sfdpFuncTables.cmdSeq2QuadDDR.supported != 0UL)
    {
        (void)memcpy((void *)ptrEntrySeq, (void *)(&(handle->cmdSeq2QuadDDR)), sizeof(sfdp_4s4d4d_entry_seq_t));
        return kSFDP_RET_Success;
    }
    else
    {
        return kSFDP_RET_NotImplemented;
    }
}

