solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/fsl_sfdp_parser.c
/*********************** Get QPI Attributes End ***********************/

/*********************** Get OPI Attributes Start ***********************/

/*!
 * @brief Get command extension of input command.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] cmd The octal command used to calculate command extension.
 *
 * @return The command extension based on current serial flash device's command policy.
 */
uint8_t SFDP_GetOctalDTRCmdExtension(sfdp_handle_t *handle, uint8_t cmd)
{
    sfdp_octal_dtr_cmd_type_t octalCmdType = SFDP_GetOctalDTRCmdType(handle);
    uint8_t cmdExtension                   = 0U;

    switch (octalCmdType)
    {
        case kSFDP_OctalDTRCmdExtensionSameAsCmd:
        {
            cmdExtension = cmd;
            break;
        }
        case kSFDP_OctalDTRCmdExtensionInvertCmd:
        {
            cmdExtension = (uint8_t)(~cmd);
            break;
        }
        case kSFDP_OctalDTRCmdExtensionCmdForm16Bit:
        {
            cmdExtension = (uint8_t)(0xFFFFU - cmd);
            break;
        }
        default:
        {
            assert(false);
        }
    }

    return cmdExtension;
}

/*!
 * @brief Check if current serial flash device support input OPI(octal spi) command.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param opiCmd The input octal spi command to check.
 *
 * @retval kSFDP_RET_OPICMDNotSupported The input opi command not supported.
 * @retval kSFDP_RET_Success The input opi command supported.
 */
sfdp_ret_type_t SFDP_CheckOPICmdSupported(sfdp_handle_t *handle, sfdp_xspi_profile_opi_cmd_t opiCmd)
{
    uint32_t mask = 0UL;
    uint8_t shift = 0U;

    if (g_sfdpFuncTables.xSPIProfile1Table.supported != 0UL)
    {
        shift = g_sfdpXspiProfile1OpiCmdShift[(uint8_t)opiCmd];
        if (shift != 0xFFU)
        {
            mask = 1UL << shift;
            if ((handle->xSPIProfile1Table.dw3 & mask) == 0UL)
            {
                return kSFDP_RET_OPICMDNotSupported;
            }
        }
    }

    if (g_sfdpFuncTables.xSPIProfile2Table.supported != 0UL)
    {
        shift = g_sfdpXspiProfile2OpiCmdShift[(uint8_t)opiCmd];
        if (shift != 0xFFU)
        {
            mask = 1UL << shift;
            if ((handle->xSPIProfile2Table.dw1 & mask) == 0UL)
            {
                return kSFDP_RET_OPICMDNotSupported;
            }
        }
    }

    if (g_sfdpFuncTables.SCCRegMapTable.supported != 0UL)
    {
        if ((handle->SCCRegMapTable.dw3 & 0x3C0UL) == 0x3C0UL)
        {
            return kSFDP_RET_OPICMDNotSupported;
        }
    }

    return kSFDP_RET_Success;
}

/*!
 * @brief Get 8d-8d-8d(octal DTR) mode entry sequences.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrEntrySeq The variable to store sequences to enter 8d-8d-8d mode.
 *
 * @retval kSFDP_RET_Success Successfully to get sequences to enter 8d-8d-8d mode.
 * @retval kSFDP_RET_NotImplemented Current serial flash device do not support sequences to enter 8d-8d-8d mode.
 */
sfdp_ret_type_t SFDP_Get8d8d8dEntrySeq(sfdp_handle_t *handle, sfdp_8d8d8d_entry_seq_t *ptrEntrySeq)
{
    if (g_sfdpFuncTables.cmdSeq2OctalDDR.supported != 0UL)
    {
        (void)memcpy((void *)ptrEntrySeq, (void *)(&(handle->cmdSeq2OctalDDR)), sizeof(sfdp_8d8d8d_entry_seq_t));
        return kSFDP_RET_Success;
    }
    else
    {
        return kSFDP_RET_NotImplemented;
    }
}

/*********************** Get OPI Attributes End ***********************/

/********************* Get Device's Commands Start ********************/
/*!
 * @brief Get read command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType The protocol type for current serial flash device.
 * @param[in] clkFreq The frequency of serial clock.
 * @param[out] ptrReadCmdInfo The variable of store read command information,
 *                          please refer to @ref sfdp_read_cmd_info_t for details.
 */
void SFDP_GetReadCmdInfo(sfdp_handle_t *handle,
                         sfdp_protocol_type_t protocolType,
                         uint32_t clkFreq,
                         sfdp_read_cmd_info_t *ptrReadCmdInfo)
{
    assert(handle != NULL);

    if (protocolType >= kSFDP_Protocol_1s1s8s)
    {
        SFDP_Get8PadReadCmd(handle, protocolType, clkFreq, ptrReadCmdInfo);
    }
    else if (protocolType >= kSFDP_Protocol_1s1s4s)
    {
        SFDP_Get4PadReadCmd(handle, protocolType, clkFreq, ptrReadCmdInfo);
    }
    else if (protocolType >= kSFDP_Protocol_1s1s2s)
    {
        SFDP_Get2PadReadCmd(handle, protocolType, ptrReadCmdInfo);
    }
    else
    {
        SFDP_Get1PadReadCmd(handle, protocolType, ptrReadCmdInfo);
    }
}

/*!
 * @brief Get chip erase information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrChipEraseCmdInfo The variable to store chip erase command information,
 *                                  please refer to @ref sfdp_chip_erase_cmd_info_t for details.
 */
void SFDP_GetChipEraseCmdInfo(sfdp_handle_t *handle, sfdp_chip_erase_cmd_info_t *ptrChipEraseCmdInfo)
{
    assert(handle != NULL);

    ptrChipEraseCmdInfo->typicalTime = 0UL;
    if (handle->curJEDECVersion >= kSFDP_JESD216A)
    {
        uint8_t tmp8 = (uint8_t)((handle->bfp.dw11 & 0x7F0000000UL) >> 24UL);

        switch ((tmp8 & 0x60U) >> 5U)
        {
            case 0x0U:
            {
                ptrChipEraseCmdInfo->typicalTime = 16UL * (tmp8 & 0x1FU);
                break;
            }
            case 0x01U:
            {
                ptrChipEraseCmdInfo->typicalTime = 256UL * (tmp8 & 0x1FU);
                break;
            }
            case 0x02U:
            {
                ptrChipEraseCmdInfo->typicalTime = 4000UL * (tmp8 & 0x1FU);
                break;
            }
            case 0x03U:
            {
                ptrChipEraseCmdInfo->typicalTime = 64000UL * (tmp8 & 0x1FU);
                break;
            }
            default:
            {
                assert(false);
            }
        }
    }

