solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/fsl_sfdp_parser.c
    ptrChipEraseCmdInfo->instruction = 0x60U;
}

/*!
 * @brief Get sector erase command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] type Used to select erase command type, please refer to @ref sfdp_erase_cmd_type_t.
 * @param[out] ptrEraseCmdInfo The variable to store erase command information,
                                please refer to @ref sfdp_erase_cmd_info_t for details.
 *
 * @retval kSFDP_RET_EraseCMDNotSupported Selected type of erase command not supported.
 * @retval kSFDP_RET_Success Successfully to get selected erase command information.
 */
sfdp_ret_type_t SFDP_GetSectorEraseCmdInfo(sfdp_handle_t *handle,
                                           sfdp_erase_cmd_type_t type,
                                           sfdp_erase_cmd_info_t *ptrEraseCmdInfo)
{
    uint32_t sizeFactor = 0UL;
    uint32_t tmp32      = 0UL;

    if (type <= kSFDP_EraseCmdType2)
    {
        tmp32 = handle->bfp.dw8;
    }
    else
    {
        tmp32 = handle->bfp.dw9;
    }

    tmp32 = (tmp32 >> (16UL * ((uint32_t)type % 2UL))) & 0xFFFFUL;

    sizeFactor = tmp32 & 0xFFUL;
    if (sizeFactor == 0UL)
    {
        return kSFDP_RET_EraseCMDNotSupported;
    }

    ptrEraseCmdInfo->eraseSize   = 1UL << sizeFactor;
    ptrEraseCmdInfo->instruction = (tmp32 & 0xFF00UL) >> 8UL;

    if ((handle->addrMode != kSFDP_AddrMode_3ByteOnly) && (g_sfdpFuncTables.fourByteAddrInstTable.supported != 0U))
    {
        ptrEraseCmdInfo->instruction = ((handle->fourByteAddrInstTable.dw2 >> (8 * (uint8_t)(type))) & 0xFFUL);
    }

    tmp32 = (handle->bfp.dw10) >> 4UL;
    tmp32 = (tmp32 >> (7UL * ((uint32_t)type % 2UL))) & 0x7FUL;

    switch ((tmp32 & 0x60U) >> 5U)
    {
        case 0x0UL:
        {
            ptrEraseCmdInfo->typicalTime = tmp32 & 0x1FUL;
            break;
        }
        case 0x1UL:
        {
            ptrEraseCmdInfo->typicalTime = (tmp32 & 0x1FUL) * 16UL;
            break;
        }
        case 0x2UL:
        {
            ptrEraseCmdInfo->typicalTime = (tmp32 & 0x1FUL) * 128UL;
            break;
        }
        case 0x3UL:
        {
            ptrEraseCmdInfo->typicalTime = (tmp32 & 0x1FUL) * 1000UL;
            break;
        }
        default:
        {
            assert(false);
        }
    }

    return kSFDP_RET_Success;
}

/*!
 * @brief Get page program command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType The protocol type for current serial flash device.
 * @param[out] ptrPageProgramCmdInfo The variable to store page program command information,
 *                                  please refer to @ref sfdp_page_program_cmd_info_t.
 */
void SFDP_GetPageProgramCmdInfo(sfdp_handle_t *handle,
                                sfdp_protocol_type_t protocolType,
                                sfdp_page_program_cmd_info_t *ptrPageProgramCmdInfo)
{
    uint32_t tmp32 = 0UL;
    if (handle->curJEDECVersion >= kSFDP_JESD216A)
    {
        tmp32 = ((handle->bfp.dw11 & 0x3F00UL) >> 8UL);
        if ((tmp32 & 0x20U) == 0U)
        {
            ptrPageProgramCmdInfo->typicalTime = ((tmp32 & 0x1FUL) + 1UL) * 8UL;
        }
        else
        {
            ptrPageProgramCmdInfo->typicalTime = ((tmp32 & 0x1FUL) + 1UL) * 64UL;
        }
    }

    ptrPageProgramCmdInfo->instruction = 0x02U;

    if ((handle->addrMode != kSFDP_AddrMode_3ByteOnly) && (g_sfdpFuncTables.fourByteAddrInstTable.supported != 0U))
    {
        /* In case of 4 byte address mode. */
        if (protocolType == kSFDP_Protocol_1s1s1s)
        {
            ptrPageProgramCmdInfo->instruction = 0x12U;
        }
        else if (protocolType == kSFDP_Protocol_1s1s4s)
        {
            ptrPageProgramCmdInfo->instruction = 0x34U;
        }
        else if (protocolType == kSFDP_Protocol_1s4s4s)
        {
            ptrPageProgramCmdInfo->instruction = 0x3EU;
        }
        else if (protocolType == kSFDP_Protocol_1s1s8s)
        {
            ptrPageProgramCmdInfo->instruction = 0x84U;
        }
        else if (protocolType == kSFDP_Protocol_1s8s8s)
        {
            ptrPageProgramCmdInfo->instruction = 0x8EU;
        }
        else if (protocolType == kSFDP_Protocol_8d8d8d)
        {
            ptrPageProgramCmdInfo->instruction = 0x12U;
        }
        else
        {
            /* Avoid violation of MISRA C-2012 rules. */
        }
    }
}

/*!
 * @brief Get read status command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType The protocol type for current serial flash device.
 * @param[out] ptrReadStatusCmdInfo The variable to store read status command information,
 *                              please refer to @ref sfdp_read_status_cmd_info_t.
 */
void SFDP_GetReadStatusCmdInfo(sfdp_handle_t *handle,
                               sfdp_protocol_type_t protocolType,
                               sfdp_read_status_cmd_info_t *ptrReadStatusCmdInfo)
{
    ptrReadStatusCmdInfo->instruction = 0x05U;
    uint32_t tmp32                    = 0UL;
    if ((g_sfdpFuncTables.SCCRegMapTable.supported != 0U))
    {
        tmp32                          = handle->SCCRegMapTable.dw3;
        ptrReadStatusCmdInfo->addrSize = 8U * (uint8_t)(((tmp32 & 0x30000000UL) >> 28UL) + 1UL);

        if (protocolType == kSFDP_Protocol_1s1s1s)
        {
            if ((tmp32 & 0xC000000UL) == 0x8000000UL)
            {
                ptrReadStatusCmdInfo->dummyCycle = (uint8_t)(tmp32 & 0xFUL);
            }
            else if ((tmp32 & 0xC000000UL) == 0UL)
            {
                ptrReadStatusCmdInfo->dummyCycle = 0U;
            }
            else if ((tmp32 & 0xC000000UL) == 0x4000000UL)
            {
                ptrReadStatusCmdInfo->dummyCycle = 8U;
            }
            else
            {
                assert(false);
            }
        }
        else if (protocolType == kSFDP_Protocol_2s2s2s)
        {
            ptrReadStatusCmdInfo->dummyCycle = (uint8_t)((tmp32 & 0x3C00000UL) >> 22UL);
        }
        else if (protocolType == kSFDP_Protocol_4s4s4s)
        {
            ptrReadStatusCmdInfo->dummyCycle = (uint8_t)((tmp32 & 0x3C0000UL) >> 18UL);
        }
        else if (protocolType == kSFDP_Protocol_4s4d4d)
        {
            ptrReadStatusCmdInfo->dummyCycle = (uint8_t)((tmp32 & 0x3C000UL) >> 14UL);
        }
        else if (protocolType == kSFDP_Protocol_8s8s8s)
        {
            ptrReadStatusCmdInfo->dummyCycle = (uint8_t)((tmp32 & 0x3C00UL) >> 10UL);
        }
        else if (protocolType == kSFDP_Protocol_8d8d8d)
        {
            ptrReadStatusCmdInfo->dummyCycle = (uint8_t)((tmp32 & 0x3C0UL) >> 6UL);
        }
        else
        {
            ptrReadStatusCmdInfo->dummyCycle = 0U;
        }
    }
    else if ((g_sfdpFuncTables.xSPIProfile2Table.supported != 0U) &&
             (g_sfdpFuncTables.SCCRegMapxSPIProfile2Table.supported != 0U))
    {
        ptrReadStatusCmdInfo->addrSize   = 48U;
        ptrReadStatusCmdInfo->dummyCycle = (uint8_t)((handle->SCCRegMapxSPIProfile2Table.dw3 & 0xF800000UL) >> 23UL);
    }
}

/*!
 * @brief Get write status command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrWriteStatusCmdInfo The variable to stor write status command information,
 *                                  please refer to @ref sfdp_write_status_cmd_info_t.
 */
void SFDP_GetWriteStatusCmdInfo(sfdp_handle_t *handle, sfdp_write_status_cmd_info_t *ptrWriteStatusCmdInfo)
{
    ptrWriteStatusCmdInfo->instruction = 0x01U;
}

/*!
 * @brief Get erase suspend/resume command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrEraseSuspendResumeCmdInfo The variable to store erase suspend/resume command information, please
 *                                          refer to @ref sfdp_erase_suspend_resume_cmd_info_t for details.
 */
void SFDP_GetEraseSuspendResumeCmdInfo(sfdp_handle_t *handle,
                                       sfdp_erase_suspend_resume_cmd_info_t *ptrEraseSuspendResumeCmdInfo)
{
    uint32_t tmp32                             = 0UL;
    ptrEraseSuspendResumeCmdInfo->suspendInstr = (uint8_t)((handle->bfp.dw13 & 0xFF000000UL) >> 24UL);
    ptrEraseSuspendResumeCmdInfo->resumeInstr  = (uint8_t)((handle->bfp.dw13 & 0xFF0000UL) >> 16UL);

    tmp32 = handle->bfp.dw12;

    if ((tmp32 & 0x60000000UL) == 0x0UL)
    {
        ptrEraseSuspendResumeCmdInfo->eraseMaxLatency = ((((tmp32 & 0x1F000000UL) >> 24UL) + 1UL) * 128UL);
    }
    else if (((tmp32 & 0x60000000UL) >> 29UL) == 0x1UL)
    {
        ptrEraseSuspendResumeCmdInfo->eraseMaxLatency = ((((tmp32 & 0x1F000000UL) >> 24UL) + 1UL) * 1000UL);
    }
    else if (((tmp32 & 0x60000000UL) >> 29UL) == 0x2UL)
    {
        ptrEraseSuspendResumeCmdInfo->eraseMaxLatency = ((((tmp32 & 0x1F000000UL) >> 24UL) + 1UL) * 8000UL);
    }
    else
    {
        ptrEraseSuspendResumeCmdInfo->eraseMaxLatency = ((((tmp32 & 0x1F000000UL) >> 24UL) + 1UL) * 64000UL);
    }

    ptrEraseSuspendResumeCmdInfo->resumeToSuspendInterval = (((tmp32 & 0xF00000UL) >> 20UL) + 1UL) * 64UL;
}

/*!
 * @brief Get program suspend/resume command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrProgramSuspendResumeCmdInfo The variable to store program suspend/resume command information,
 * please refer to @ref sfdp_program_suspend_cmd_info_t for details.
 */
void SFDP_GetProgramSuspendResumeCmdInfo(sfdp_handle_t *handle,
                                         sfdp_program_suspend_cmd_info_t *ptrProgramSuspendResumeCmdInfo)
{
    uint32_t tmp32                               = 0UL;
    ptrProgramSuspendResumeCmdInfo->suspendInstr = (uint8_t)((handle->bfp.dw13 & 0xFF00UL) >> 8UL);
    ptrProgramSuspendResumeCmdInfo->resumeInstr  = (uint8_t)(handle->bfp.dw13 & 0xFFUL);

    tmp32 = handle->bfp.dw12;

    if ((tmp32 & 0xC0000UL) == 0UL)
    {
        ptrProgramSuspendResumeCmdInfo->eraseMaxLatency = ((((tmp32 & 0x3E000UL) >> 13UL) + 1UL) * 128UL);
    }
    else if ((tmp32 & 0xC0000UL) == (1UL << 18UL))
    {
        ptrProgramSuspendResumeCmdInfo->eraseMaxLatency = ((((tmp32 & 0x3E000UL) >> 13UL) + 1UL) * 1000UL);
    }
    else if ((tmp32 & 0xC0000UL) == (2UL << 18UL))
    {
        ptrProgramSuspendResumeCmdInfo->eraseMaxLatency = ((((tmp32 & 0x3E000UL) >> 13UL) + 1UL) * 8000UL);
    }
    else
    {
        ptrProgramSuspendResumeCmdInfo->eraseMaxLatency = ((((tmp32 & 0x3E000UL) >> 13UL) + 1UL) * 64000UL);
    }

