solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/fsl_sfdp_parser.c
    ptrProgramSuspendResumeCmdInfo->resumeToSuspendInterval = (((tmp32 & 0x1E00UL) >> 9UL) + 1UL) * 64UL;
}

/*!
 * @brief Get deep power down command information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[out] ptrDeepPowerDownCmdInfo The variable to store deep power down command information, please refer to
 * @ref sfdp_deep_power_down_cmd_info_t for details.
 */
void SFDP_GetDeepPowerDownCmdInfo(sfdp_handle_t *handle, sfdp_deep_power_down_cmd_info_t *ptrDeepPowerDownCmdInfo)
{
    uint32_t tmp32                                   = handle->bfp.dw14;
    ptrDeepPowerDownCmdInfo->enterDeepPowerDownInstr = (uint8_t)((tmp32 & 0x7F800000UL) >> 23UL);
    ptrDeepPowerDownCmdInfo->exitDeepPowerDownDelay  = (uint8_t)((tmp32 & 0x7F8000UL) >> 15UL);

    if ((tmp32 & 0x6000) == 0UL)
    {
        ptrDeepPowerDownCmdInfo->exitDeepPowerDownDelay = (((tmp32 & 0x1F00UL) >> 8UL) + 1UL) * 128UL;
    }
    else if ((tmp32 & 0x6000) == (1UL << 13UL))
    {
        ptrDeepPowerDownCmdInfo->exitDeepPowerDownDelay = (((tmp32 & 0x1F00UL) >> 8UL) + 1UL) * 1000UL;
    }
    else if ((tmp32 & 0x6000) == (2UL << 13UL))
    {
        ptrDeepPowerDownCmdInfo->exitDeepPowerDownDelay = (((tmp32 & 0x1F00UL) >> 8UL) + 1UL) * 8000UL;
    }
    else
    {
        ptrDeepPowerDownCmdInfo->exitDeepPowerDownDelay = (((tmp32 & 0x1F00UL) >> 8UL) + 1UL) * 64000UL;
    }
}

/********************* Get Device's Commands End ********************/

/************** Get Device register bit field information Start ************/
/*!
 * @brief Get busy bit field information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] padNum Number of data pad.
 * @param[out] ptrBusyBitInfo The variable to store busy bit information.
 *
 * @retval kSFDP_RET_Success Successfully to get busy bit field information.
 */
sfdp_ret_type_t SFDP_GetBusyBitInfo(sfdp_handle_t *handle,
                                    sfdp_flash_pad_num_t padNum,
                                    sfdp_wip_bit_info_t *ptrBusyBitInfo)
{
    assert(handle != NULL);

    uint32_t bfpDw14 = handle->bfp.dw14;
    uint32_t sccrDw5 = 0UL;

    ptrBusyBitInfo->upperHalfWordSelected = false;
    if ((bfpDw14 & 0x2UL) != 0UL)
    {
        ptrBusyBitInfo->readInstr  = 0x05U;
        ptrBusyBitInfo->writeInstr = 0x01U;
        ptrBusyBitInfo->polarity   = false;
        ptrBusyBitInfo->location   = 0U;
    }
    else if ((bfpDw14 & 0x4UL) != 0UL)
    {
        ptrBusyBitInfo->readInstr  = 0x70U;
        ptrBusyBitInfo->writeInstr = 0x50U;
        ptrBusyBitInfo->polarity   = true;
        ptrBusyBitInfo->location   = 7U;
    }
    else
    {
        /* Reserved. */
    }

    if ((padNum == kSFDP_Flash1Pad))
    {
        ptrBusyBitInfo->dummyCycles   = 0U;
        ptrBusyBitInfo->addrFollowCmd = false;
    }

    if (g_sfdpFuncTables.SCCRegMapTable.supported)
    {
        sccrDw5 = handle->SCCRegMapTable.dw5;
        if ((sccrDw5 & 0x80000000UL) != 0UL)
        {
            if ((sccrDw5 & 0x10000000UL) != 0UL)
            {
                ptrBusyBitInfo->addrFollowCmd = true;
            }
            else
            {
                ptrBusyBitInfo->addrFollowCmd = false;
            }

            ptrBusyBitInfo->polarity              = ((sccrDw5 & 0x40000000UL) != 0x0UL) ? true : false;
            ptrBusyBitInfo->readInstr             = (uint8_t)((sccrDw5 & 0xFF00UL) >> 8UL);
            ptrBusyBitInfo->upperHalfWordSelected = ((sccrDw5 & 0x10000000UL) != 0UL) ? true : false;
            ptrBusyBitInfo->location              = (uint8_t)((sccrDw5 & 0x7000000UL) >> 24UL);
            ptrBusyBitInfo->dummyCycles           = (uint8_t)((sccrDw5 & 0xF0000UL) >> 16UL);
        }
    }

    return kSFDP_RET_Success;
}

/*!
 * @brief Get WEL(write enable) bit field information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType Current selected protocol type.
 * @param[out] ptrWelBitInfo The variable to store WEL bit information.
 *
 * @retval kSFDP_RET_Success Successfully to get WEL bit field information.
 */
sfdp_ret_type_t SFDP_GetWELBitInfo(sfdp_handle_t *handle,
                                   sfdp_protocol_type_t protocolType,
                                   sfdp_wel_bit_info_t *ptrWelBitInfo)
{
    assert(handle != NULL);

    uint32_t tmp32 = handle->SCCRegMapTable.dw6;

    if ((tmp32 & (1UL << 31UL)) == 0UL)
    {
        return kSFDP_RET_NotImplemented;
    }

    if ((tmp32 & (1UL << 29UL)) != 0UL)
    {
        return kSFDP_RET_RegBitNotSupported;
    }

    ptrWelBitInfo->dummyCycles = 0U;
    if ((tmp32 & (1UL << 28UL)) == 0UL)
    {
        ptrWelBitInfo->addrFollowCmd = false;

        if ((protocolType == kSFDP_Protocol_4s4s4s) && ((tmp32 & (1UL << 20UL)) != 0UL))
        {
            ptrWelBitInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }

        if ((protocolType == kSFDP_Protocol_4s4d4d) && ((tmp32 & (1UL << 21UL)) != 0UL))
        {
            ptrWelBitInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }

        if ((protocolType == kSFDP_Protocol_8s8s8s) && ((tmp32 & (1UL << 22UL)) != 0UL))
        {
            ptrWelBitInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }

        if ((protocolType == kSFDP_Protocol_8d8d8d) && ((tmp32 & (1UL << 23UL)) != 0UL))
        {
            ptrWelBitInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }
    }
    else
    {
        ptrWelBitInfo->addrFollowCmd = true;
    }

    ptrWelBitInfo->readInstr             = (uint8_t)((tmp32 & 0xFF00UL) >> 8UL);
    ptrWelBitInfo->writeInstr            = (uint8_t)(tmp32 & 0xFFUL);
    ptrWelBitInfo->polarity              = ((tmp32 & (1UL << 30UL)) != 0UL);
    ptrWelBitInfo->location              = (uint8_t)((tmp32 & 0x7000000UL) >> 24UL);
    ptrWelBitInfo->upperHalfWordSelected = (bool)((tmp32 & (1UL << 27UL)) != 0UL);
    return kSFDP_RET_Success;
}

/*!
 * @brief Get program error bit field information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType Specify the protocol type to use.
 * @param[out] ptrProgramErrorBitInfo The variable to store program error bit information.
 *
 * @retval kSFDP_RET_NotImplemented Current serial flash do not implement the parameter table.
 * @retval kSFDP_RET_RegBitNotSupported Current serial flash do not support program error bit.
 * @retval kSFDP_RET_Success Successfully to get program error bit field information.
 */
sfdp_ret_type_t SFDP_GetProgramErrorBitInfo(sfdp_handle_t *handle,
                                            sfdp_protocol_type_t protocolType,
                                            sfdp_program_error_bit_info_t *ptrProgramErrorBitInfo)
{
    assert(handle != NULL);

    uint32_t tmp32 = handle->SCCRegMapTable.dw7;

    if ((tmp32 & (1UL << 31UL)) == 0UL)
    {
        return kSFDP_RET_NotImplemented;
    }

    if ((tmp32 & (1UL << 29UL)) != 0UL)
    {
        return kSFDP_RET_RegBitNotSupported;
    }

