solfamila/psram/mimxrt700evk_xspi_psram_polling_transfer_cm33_core0/__repo__/components/flash/nor/fsl_sfdp_parser.c
    ptrProgramErrorBitInfo->dummyCycles = 0U;
    if ((tmp32 & (1UL << 28UL)) == 0UL)
    {
        ptrProgramErrorBitInfo->addrFollowCmd = false;

        if ((protocolType == kSFDP_Protocol_4s4s4s) && ((tmp32 & (1UL << 20UL)) != 0UL))
        {
            ptrProgramErrorBitInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }

        if ((protocolType == kSFDP_Protocol_4s4d4d) && ((tmp32 & (1UL << 21UL)) != 0UL))
        {
            ptrProgramErrorBitInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }

        if ((protocolType == kSFDP_Protocol_8s8s8s) && ((tmp32 & (1UL << 22UL)) != 0UL))
        {
            ptrProgramErrorBitInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }

        if ((protocolType == kSFDP_Protocol_8d8d8d) && ((tmp32 & (1UL << 23UL)) != 0UL))
        {
            ptrProgramErrorBitInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }
    }
    else
    {
        ptrProgramErrorBitInfo->addrFollowCmd = true;
    }

    ptrProgramErrorBitInfo->readInstr             = (uint8_t)((tmp32 & 0xFF00UL) >> 8UL);
    ptrProgramErrorBitInfo->writeInstr            = (uint8_t)(tmp32 & 0xFFUL);
    ptrProgramErrorBitInfo->polarity              = ((tmp32 & (1UL << 30UL)) != 0UL);
    ptrProgramErrorBitInfo->location              = (uint8_t)((tmp32 & 0x7000000UL) >> 24UL);
    ptrProgramErrorBitInfo->upperHalfWordSelected = (bool)((tmp32 & (1UL << 27UL)) != 0UL);
    return kSFDP_RET_Success;
}

/*!
 * @brief Get erase error bit field information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType Specify the protocol type to use.
 * @param[out] ptrEraseErrorBitInfo The variable to store erase error bit information.
 *
 * @retval kSFDP_RET_NotImplemented Current serial flash do not implement the parameter table.
 * @retval kSFDP_RET_RegBitNotSupported Current serial flash do not support erase error bit.
 * @retval kSFDP_RET_Success Successfully to get erase error bit field information.
 */
sfdp_ret_type_t SFDP_GetEraseErrorBitInfo(sfdp_handle_t *handle,
                                          sfdp_protocol_type_t protocolType,
                                          sfdp_erase_error_bit_info_t *ptrEraseErrorBitInfo)
{
    assert(handle != NULL);

    uint32_t tmp32 = handle->SCCRegMapTable.dw8;

    if ((tmp32 & (1UL << 31UL)) == 0UL)
    {
        return kSFDP_RET_NotImplemented;
    }

    if ((tmp32 & (1UL << 29UL)) != 0UL)
    {
        return kSFDP_RET_RegBitNotSupported;
    }

    ptrEraseErrorBitInfo->dummyCycles = 0U;
    if ((tmp32 & (1UL << 28UL)) == 0UL)
    {
        ptrEraseErrorBitInfo->addrFollowCmd = false;

        if ((protocolType == kSFDP_Protocol_4s4s4s) && ((tmp32 & (1UL << 20UL)) != 0UL))
        {
            ptrEraseErrorBitInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }

        if ((protocolType == kSFDP_Protocol_4s4d4d) && ((tmp32 & (1UL << 21UL)) != 0UL))
        {
            ptrEraseErrorBitInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }

        if ((protocolType == kSFDP_Protocol_8s8s8s) && ((tmp32 & (1UL << 22UL)) != 0UL))
        {
            ptrEraseErrorBitInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }

        if ((protocolType == kSFDP_Protocol_8d8d8d) && ((tmp32 & (1UL << 23UL)) != 0UL))
        {
            ptrEraseErrorBitInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }
    }
    else
    {
        ptrEraseErrorBitInfo->addrFollowCmd = true;
    }

    ptrEraseErrorBitInfo->readInstr             = (uint8_t)((tmp32 & 0xFF00UL) >> 8UL);
    ptrEraseErrorBitInfo->writeInstr            = (uint8_t)(tmp32 & 0xFFUL);
    ptrEraseErrorBitInfo->polarity              = ((tmp32 & (1UL << 30UL)) != 0UL);
    ptrEraseErrorBitInfo->location              = (uint8_t)((tmp32 & 0x7000000UL) >> 24UL);
    ptrEraseErrorBitInfo->upperHalfWordSelected = (bool)((tmp32 & (1UL << 27UL)) != 0UL);
    return kSFDP_RET_Success;
}

/*!
 * @brief Get variable dummy cycle information.
 *
 * @param[in] handle The parameter in type of @ref sfdp_handle_t.
 * @param[in] protocolType Specify the protocol type to use.
 * @param[out] ptrVariableDCInfo The variable to updated dummy cycle value..
 *
 * @retval kSFDP_RET_NotImplemented Current serial flash do not implement the parameter table.
 * @retval kSFDP_RET_RegBitNotSupported Current serial flash do not support variable dummy cycle bit.
 * @retval kSFDP_RET_Success Successfully to get variable dummy cycle bit field information.
 */
sfdp_ret_type_t SFDP_GetVolatileVariableDummyCycleInfo(sfdp_handle_t *handle,
                                                       sfdp_protocol_type_t protocolType,
                                                       sfdp_variable_dummy_cycle_t *ptrVariableDCInfo)
{
    assert(handle != NULL);

    uint32_t tmp32 = handle->SCCRegMapTable.dw9;

    if ((tmp32 & (1UL << 31UL)) == 0UL)
    {
        return kSFDP_RET_NotImplemented;
    }

    if ((tmp32 & (1UL << 29UL)) != 0UL)
    {
        return kSFDP_RET_RegBitNotSupported;
    }

    ptrVariableDCInfo->dummyCycles = 0U;
    if ((tmp32 & (1UL << 28UL)) == 0UL)
    {
        ptrVariableDCInfo->addrFollowCmd = false;

        if ((protocolType == kSFDP_Protocol_4s4s4s) && ((tmp32 & (1UL << 20UL)) != 0UL))
        {
            ptrVariableDCInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }

        if ((protocolType == kSFDP_Protocol_4s4d4d) && ((tmp32 & (1UL << 21UL)) != 0UL))
        {
            ptrVariableDCInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }

        if ((protocolType == kSFDP_Protocol_8s8s8s) && ((tmp32 & (1UL << 22UL)) != 0UL))
        {
            ptrVariableDCInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }

        if ((protocolType == kSFDP_Protocol_8d8d8d) && ((tmp32 & (1UL << 23UL)) != 0UL))
        {
            ptrVariableDCInfo->dummyCycles = (uint8_t)((tmp32 & 0xF0000UL) >> 16UL);
        }
    }
    else
    {
        ptrVariableDCInfo->addrFollowCmd = true;
    }

    ptrVariableDCInfo->readInstr             = (uint8_t)((tmp32 & 0xFF00UL) >> 8UL);
    ptrVariableDCInfo->writeInstr            = (uint8_t)(tmp32 & 0xFFUL);
    ptrVariableDCInfo->bitFieldWidth         = ((tmp32 & 0x60000000UL) >> 29UL);
    ptrVariableDCInfo->location              = (uint8_t)((tmp32 & 0x7000000UL) >> 24UL);
    ptrVariableDCInfo->upperHalfWordSelected = (bool)((tmp32 & (1UL << 27UL)) != 0UL);

    return kSFDP_RET_Success;
}
/************** Get Device register bit field information End ************/
